import matplotlib.pyplot as plt

# 创建一个 1x1 的画布
fig, ax = plt.subplots(figsize=(1, 1))

# 传入的三个浮点坐标点
# points = [(0.34912538528442383, 0.5894260406494141), (0.5906023979187012, 0.6310534477233887)]
points = [
    (0.34912538528442383, 1-0.5894260406494141), (0.5906023979187012, 1-0.6310534477233887),
    (0.5075704455375671, 1-0.392514169216156), (0.6104493141174316, 1-0.43798646330833435),
    (0.3108709454536438, 1-0.42030322551727295), (0.46281182765960693, 1-0.47923123836517334),
]

# 绘制每个点
for point in points:
    ax.plot(point[0], point[1], marker='o', markersize=5, color='red')

# 设置坐标轴范围
ax.set_xlim(0, 1)
ax.set_ylim(0, 1)

# 显示绘图
plt.show()
